In [1]:
import pandas as pd
import numpy as np

In [2]:
s1 = np.random.randint(10,size=5)
s2 = np.random.randint(10,size=5)
s3 = np.random.randint(10,size=5)

In [3]:
sozluk = {"var1":s1,"var2":s2,"var3":s3}
sozluk

{'var1': array([9, 7, 1, 7, 0]),
 'var2': array([6, 8, 2, 8, 4]),
 'var3': array([4, 5, 1, 3, 4])}

In [4]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     9     6     4
1     7     8     5
2     1     2     1
3     7     8     3
4     0     4     4

In [5]:
df[0:1]

   var1  var2  var3
0     9     6     4

In [6]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [9]:
df.index = ["a","b","c","d","e"]
df

   var1  var2  var3
a     9     6     4
b     7     8     5
c     1     2     1
d     7     8     3
e     0     4     4

In [10]:
df.drop("a",axis=0) #satırı Silme

   var1  var2  var3
b     7     8     5
c     1     2     1
d     7     8     3
e     0     4     4

In [11]:
df

   var1  var2  var3
a     9     6     4
b     7     8     5
c     1     2     1
d     7     8     3
e     0     4     4

In [12]:
df.drop("a",axis=0,inplace=True) #Kalici Silme

In [13]:
df

   var1  var2  var3
b     7     8     5
c     1     2     1
d     7     8     3
e     0     4     4

In [14]:
l = ["c","e"]

In [15]:
df.drop(l,axis=0)

   var1  var2  var3
b     7     8     5
d     7     8     3